Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/government_departments/administration_of_government_departments.html.txt.tmx
Source language: en
Languages: ga

source: Administration of government departments
ga: Riarachán na ranna rialtais

source: Each minister of the Government is responsible for running and managing the department they have been allocated
ga: Tá freagracht maidir le riarachán agus bainistiú na Roinne atá faoina c(h)úram ar an Aire atá i gceannas na Roinne sin

source: There are 16 government departments
ga: Tá iomlán 16 ranna rialtais

source: You can find out about government spending in each of these departments on whereyourmoneygoes.gov.ie
ga: Chomh maith leis an Aire comh-aireachta atá i gceannas na Roinne is minic go mbíonn Aire Stáit freisin ag an Roinn

source: Each department employs a large number of civil servants, including a Secretary General, who remain in their positions regardless of changes in the Government
ga: Tá líon mór Státseirbhísí ag obair sa Roinn, san áireamh tá Ard Rúnaí, a fhanann ina bpost fiú le athrú Rialtais

source: These officials advise and assist the minister in the running of the department
ga: Cuireann na hoifigigh seo comhairle ar an Aire agus tugann siad cúnamh dó/dí an Roinn a riaradh

source: The minister may suggest and propose new or amended legislation to the Government relating to matters that arise in their department
ga: Is féidir leis an Aire a mholadh go ndéanfaí reachtú nua a chuir i bhfeidhm nó dlí a bhí ann cheana a leasú atá bainteach lena Roinn féin

source: Ministers also have a power to make Statutory Instruments which are also known as delegated or secondary legislation
ga: Tá sé de chumhacht ag Airí Ionstraim Reachtúla a dhéanamh. Tugtar Fo-reachtú orthu seo freisin

source: Statutory Instruments allow the minister to give effect to or implement legislation without the need to have every detail passed by the Oireachtas
ga: Tugann Ionstraim Reachtúla an deis don Aire an dlí a chuir i bhfeidhm gan gach gné de a bheith glactha ag an Oireachtas

source: Statutory Instruments do not have to be approved by the Oireachtas, although they may be cancelled by either House
ga: Ní gá do Ionstraim Reachtúla a bheith ceadaithe ag an Oireachtas cé gur féidir le ceachtar den dá theach iad a chuir ar ceal

source: You can view all Irish Government legislation from 1922 onwards
ga: Féach iomlán reachtaíocht Rialtais na hÉireann ó 1922

source: Code of practice on accessibility of public services and information provided by public bodies
ga: Cód cleachtais ar inrochtaineacht seirbhísí poiblí agus faisnéise a chuireann comhlachtaí poiblí ar fáil

source: The Disability Act 2005 provides a statutory basis for accessible public services
ga: Cuireann an tAcht um Míchumas 2005 bunús reachtúil ar fáil i gcomhair seirbhísí poiblí inrochtana

source: Sections 26, 27 and 28 of the Act place obligations on public bodies to make their services and information accessible to people with disabilities
ga: Cuireann Ailt 26, 27 agus 28 den Acht oibleagáidí ar chomhlachtaí poiblí rochtain ar bheith ar fáil do dhaoine faoi mhíchumas ar a gcuid seirbhísí agus a gcuid faisnéise

source: The Department of Justice and Equality charged the National Disability Authority (NDA) with developing a Code of practice on accessibility of public services and information provided by public bodies as set out under Section 30 of the Act
ga: Tá an Roinn Dlí agus Cirt, agus Comhionannais tar éis an cúram a chur ar an Údarás Náisiúnta Míchumais a fhorbairt Cód cleachtais ar inrochtaineacht seirbhísí poiblí agus faisnéise a chuireann comhlachtaí poiblí ar fáil (pdf)

source: The purpose of this Code is to guide public bodies to meet their obligations under the Act
ga: Is í an aidhm atá ag an gCód seo ná comhlachtaí poiblí a threorú chun a gcuid oibleagáidí a chomhlíonadh faoin Acht

source: The Code covers a wide range of services provided by public bodies - including the provision of information, information resources, schemes, allowances or other benefits administered by public bodies
ga: Clúdaíonn an Cód réimse leathan seirbhísí a chuireann comhlachtaí poiblí ar fáil - lena n-áirítear soláthar faisnéise, acmhainní faisnéise, scéimeanna, liúntais nó sochair eile arna reáchtáil ag comhlachtaí poiblí
